/*
 * ascii.cpp (MusterlÃ¶sung)
 * Autor: Ralf Sasse
 * Datum: 30.10.2023 (FINF28 / Tag 5)
 *
 * Erstellen Sie ein C++-Programm, das eine Tabelle mit allen druckbaren
 * ANSI-Zeichen (32 bis 255) ausgibt, siehe Beispielausgabe. Zu jedem Zeichen
 * soll der Zeichencode in dezimaler, oktaler und hexadezimaler Schreibweise
 * ausgegeben werden.
 *
 * Beispielausgabe:
 *
 * â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
 * â”‚ dez okt hex    â”‚ dez okt hex    â”‚ dez okt hex    â”‚ dez okt hex    â”‚ dez okt hex    â”‚ dez okt hex    â”‚ dez okt hex    â”‚
 * â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
 * â”‚  32  40  20    â”‚  64 100  40  @ â”‚  96 140  60  ` â”‚ 128 200  80  Ã‡ â”‚ 160 240  A0  Ã¡ â”‚ 192 300  C0  â”” â”‚ 224 340  E0  Ã“ â”‚
 * â”‚  33  41  21  ! â”‚  65 101  41  A â”‚  97 141  61  a â”‚ 129 201  81  Ã¼ â”‚ 161 241  A1  Ã­ â”‚ 193 301  C1  â”´ â”‚ 225 341  E1  ÃŸ â”‚
 * â”‚  34  42  22  " â”‚  66 102  42  B â”‚  98 142  62  b â”‚ 130 202  82  Ã© â”‚ 162 242  A2  Ã³ â”‚ 194 302  C2  â”¬ â”‚ 226 342  E2  Ã” â”‚
 * â”‚  35  43  23  # â”‚  67 103  43  C â”‚  99 143  63  c â”‚ 131 203  83  Ã¢ â”‚ 163 243  A3  Ãº â”‚ 195 303  C3  â”œ â”‚ 227 343  E3  Ã’ â”‚
 * â”‚  36  44  24  $ â”‚  68 104  44  D â”‚ 100 144  64  d â”‚ 132 204  84  Ã¤ â”‚ 164 244  A4  Ã± â”‚ 196 304  C4  â”€ â”‚ 228 344  E4  Ãµ â”‚
 * â”‚  37  45  25  % â”‚  69 105  45  E â”‚ 101 145  65  e â”‚ 133 205  85  Ã  â”‚ 165 245  A5  Ã‘ â”‚ 197 305  C5  â”¼ â”‚ 229 345  E5  Ã• â”‚
 * â”‚  38  46  26  & â”‚  70 106  46  F â”‚ 102 146  66  f â”‚ 134 206  86  Ã¥ â”‚ 166 246  A6  Âª â”‚ 198 306  C6  Ã£ â”‚ 230 346  E6  Âµ â”‚
 * â”‚  39  47  27  ' â”‚  71 107  47  G â”‚ 103 147  67  g â”‚ 135 207  87  Ã§ â”‚ 167 247  A7  Âº â”‚ 199 307  C7  Ãƒ â”‚ 231 347  E7  Ã¾ â”‚
 * â”‚  40  50  28  ( â”‚  72 110  48  H â”‚ 104 150  68  h â”‚ 136 210  88  Ãª â”‚ 168 250  A8  Â¿ â”‚ 200 310  C8  â•š â”‚ 232 350  E8  Ãž â”‚
 * â”‚  41  51  29  ) â”‚  73 111  49  I â”‚ 105 151  69  i â”‚ 137 211  89  Ã« â”‚ 169 251  A9  Â® â”‚ 201 311  C9  â•” â”‚ 233 351  E9  Ãš â”‚
 * â”‚  42  52  2A  * â”‚  74 112  4A  J â”‚ 106 152  6A  j â”‚ 138 212  8A  Ã¨ â”‚ 170 252  AA  Â¬ â”‚ 202 312  CA  â•© â”‚ 234 352  EA  Ã› â”‚
 * â”‚  43  53  2B  + â”‚  75 113  4B  K â”‚ 107 153  6B  k â”‚ 139 213  8B  Ã¯ â”‚ 171 253  AB  Â½ â”‚ 203 313  CB  â•¦ â”‚ 235 353  EB  Ã™ â”‚
 * â”‚  44  54  2C  , â”‚  76 114  4C  L â”‚ 108 154  6C  l â”‚ 140 214  8C  Ã® â”‚ 172 254  AC  Â¼ â”‚ 204 314  CC  â•  â”‚ 236 354  EC  Ã½ â”‚
 * â”‚  45  55  2D  - â”‚  77 115  4D  M â”‚ 109 155  6D  m â”‚ 141 215  8D  Ã¬ â”‚ 173 255  AD  Â¡ â”‚ 205 315  CD  â• â”‚ 237 355  ED  Ã â”‚
 * â”‚  46  56  2E  . â”‚  78 116  4E  N â”‚ 110 156  6E  n â”‚ 142 216  8E  Ã„ â”‚ 174 256  AE  Â« â”‚ 206 316  CE  â•¬ â”‚ 238 356  EE  Â¯ â”‚
 * â”‚  47  57  2F  / â”‚  79 117  4F  O â”‚ 111 157  6F  o â”‚ 143 217  8F  Ã… â”‚ 175 257  AF  Â» â”‚ 207 317  CF  Â¤ â”‚ 239 357  EF  Â´ â”‚
 * â”‚  48  60  30  0 â”‚  80 120  50  P â”‚ 112 160  70  p â”‚ 144 220  90  Ã‰ â”‚ 176 260  B0  â–‘ â”‚ 208 320  D0  Ã° â”‚ 240 360  F0  Â­  â”‚
 * â”‚  49  61  31  1 â”‚  81 121  51  Q â”‚ 113 161  71  q â”‚ 145 221  91  Ã¦ â”‚ 177 261  B1  â–’ â”‚ 209 321  D1  Ã â”‚ 241 361  F1  Â± â”‚
 * â”‚  50  62  32  2 â”‚  82 122  52  R â”‚ 114 162  72  r â”‚ 146 222  92  Ã† â”‚ 178 262  B2  â–“ â”‚ 210 322  D2  ÃŠ â”‚ 242 362  F2  â€— â”‚
 * â”‚  51  63  33  3 â”‚  83 123  53  S â”‚ 115 163  73  s â”‚ 147 223  93  Ã´ â”‚ 179 263  B3  â”‚ â”‚ 211 323  D3  Ã‹ â”‚ 243 363  F3  Â¾ â”‚
 * â”‚  52  64  34  4 â”‚  84 124  54  T â”‚ 116 164  74  t â”‚ 148 224  94  Ã¶ â”‚ 180 264  B4  â”¤ â”‚ 212 324  D4  Ãˆ â”‚ 244 364  F4  Â¶ â”‚
 * â”‚  53  65  35  5 â”‚  85 125  55  U â”‚ 117 165  75  u â”‚ 149 225  95  Ã² â”‚ 181 265  B5  Ã â”‚ 213 325  D5  Ä± â”‚ 245 365  F5  Â§ â”‚
 * â”‚  54  66  36  6 â”‚  86 126  56  V â”‚ 118 166  76  v â”‚ 150 226  96  Ã» â”‚ 182 266  B6  Ã‚ â”‚ 214 326  D6  Ã â”‚ 246 366  F6  Ã· â”‚
 * â”‚  55  67  37  7 â”‚  87 127  57  W â”‚ 119 167  77  w â”‚ 151 227  97  Ã¹ â”‚ 183 267  B7  Ã€ â”‚ 215 327  D7  ÃŽ â”‚ 247 367  F7  Â¸ â”‚
 * â”‚  56  70  38  8 â”‚  88 130  58  X â”‚ 120 170  78  x â”‚ 152 230  98  Ã¿ â”‚ 184 270  B8  Â© â”‚ 216 330  D8  Ã â”‚ 248 370  F8  Â° â”‚
 * â”‚  57  71  39  9 â”‚  89 131  59  Y â”‚ 121 171  79  y â”‚ 153 231  99  Ã– â”‚ 185 271  B9  â•£ â”‚ 217 331  D9  â”˜ â”‚ 249 371  F9  Â¨ â”‚
 * â”‚  58  72  3A  : â”‚  90 132  5A  Z â”‚ 122 172  7A  z â”‚ 154 232  9A  Ãœ â”‚ 186 272  BA  â•‘ â”‚ 218 332  DA  â”Œ â”‚ 250 372  FA  Â· â”‚
 * â”‚  59  73  3B  ; â”‚  91 133  5B  [ â”‚ 123 173  7B  { â”‚ 155 233  9B  Ã¸ â”‚ 187 273  BB  â•— â”‚ 219 333  DB  â–ˆ â”‚ 251 373  FB  Â¹ â”‚
 * â”‚  60  74  3C  < â”‚  92 134  5C  \ â”‚ 124 174  7C  | â”‚ 156 234  9C  Â£ â”‚ 188 274  BC  â• â”‚ 220 334  DC  â–„ â”‚ 252 374  FC  Â³ â”‚
 * â”‚  61  75  3D  = â”‚  93 135  5D  ] â”‚ 125 175  7D  } â”‚ 157 235  9D  Ã˜ â”‚ 189 275  BD  Â¢ â”‚ 221 335  DD  Â¦ â”‚ 253 375  FD  Â² â”‚
 * â”‚  62  76  3E  > â”‚  94 136  5E  ^ â”‚ 126 176  7E  ~ â”‚ 158 236  9E  Ã— â”‚ 190 276  BE  Â¥ â”‚ 222 336  DE  ÃŒ â”‚ 254 376  FE  â–  â”‚
 * â”‚  63  77  3F  ? â”‚  95 137  5F  _ â”‚ 127 177  7F    â”‚ 159 237  9F  Æ’ â”‚ 191 277  BF  â” â”‚ 223 337  DF  â–€ â”‚ 255 377  FF    â”‚
 * â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
 */

#include <iostream>
#include <iomanip>
using namespace std;

#define OBEN  1
#define TITEL 2
#define MITTE 3
#define UNTEN 4

void linie(int);		// Prototyp

int main()
{
	linie(OBEN);		// oberste Zeile
	linie(TITEL);		// Titelzeile (SpaltenkÃ¶pfe)
	linie(MITTE);		// Trennlinie

	int zeichen = 0;

	for (int i = 0; i < 32; i++)
	{
		zeichen = i;

		cout << (char)179;

		for (int j = 0; j < 7; j++)
		{
			zeichen += 32;

			cout << dec << setw(4) << zeichen
				<< oct << setw(4) << zeichen
				<< hex << setw(4) << zeichen
				<< "  " << (char)zeichen << " " << (char)179;
		}

		cout << endl;
	}

	linie(UNTEN);		// unterste Zeile

	return 0;
}

void linie(int position)
{
	switch (position)
	{
	case OBEN:  cout << (char)218; break;
	case TITEL: cout << (char)179; break;
	case MITTE: cout << (char)195; break;
	case UNTEN: cout << (char)192;
	}

	for (int i = 0; i < 7; i++)
	{
		if (position == TITEL)
		{
			cout << " dez okt hex    ";
		}
		else
		{
			for (int j = 0; j < 16; j++)
			{
				cout << (char)196;
			}
		}

		if (i < 6)
		{
			switch (position)
			{
			case OBEN:  cout << (char)194; break;
			case TITEL: cout << (char)179; break;
			case MITTE: cout << (char)197; break;
			case UNTEN: cout << (char)193;
			}
		}
		else
		{
			switch (position)
			{
			case OBEN:  cout << (char)191; break;
			case TITEL: cout << (char)179; break;
			case MITTE: cout << (char)180; break;
			case UNTEN: cout << (char)217;
			}
		}
	}

	cout << endl;
}